#Если Сервер Тогда

// Получить из кэша
Функция ПолучитьИзКэша(Ключ, ВремяЖизни = 300) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Данные ИЗ РегСвед.КэшОтчетов ГДЕ Ключ = &Ключ И ДатаМод > &МинДата";
    Запрос.УстановитьПараметр("Ключ", Ключ);
    Запрос.УстановитьПараметр("МинДата", ТДСеанса() - ВремяЖизни);
    Рез = Запрос.Выполнить();
    Если НЕ Рез.Пустой() Тогда Возврат Рез.Выбрать().Данные.Получить(); КонецЕсли;
    Возврат Неопределено;
КонецФункции

// Сохранить в кэш
Процедура СохранитьВКэш(Ключ, Данные) Экспорт
    УдалитьИзКэша(Ключ);
    Попытка
        Запись = РегСвед.КэшОтчетов.СоздатьНаборЗаписей();
        НЗапись = Запись.Добавить();
        НЗапись.Ключ = Ключ;
        НЗапись.Данные.Установить(Данные);
        НЗапись.ДатаМодификации = ТДСеанса();
        Запись.Записать();
    Исключение КонецПопытки;
КонецПроцедуры

// Удалить из кэша
Процедура УдалитьИзКэша(Ключ) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Ключ ИЗ РегСвед.КэшОтчетов ГДЕ Ключ = &Ключ ДИ");
    Запрос.УстановитьПараметр("Ключ", Ключ);
    Рез = Запрос.Выполнить();
    Выборка = Рез.Выбрать();
    Пока Выборка.Следующий() Цикл Выборка.Удалить(); КонецЦикла;
КонецПроцедуры

#КонецЕсли
